IDEA StatiCa Open Model
Settlement.ValueX Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Settlement in X dirrection of support
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double ValueX { get; set; }
Public Property ValueX As Double
	Get
	Set
public:
property double ValueX {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
Settlement Class
IdeaRS.OpenModel.Loading Namespace